message = "3. Пользователь вводит месяц в виде целого числа от 1 до 12.\n" \
            + "Сообщить к какому времени года относится месяц (зима, весна, лето, осень).\n" \
            + "Напишите решения через list и через dict.\n"
print(message)

month = 0
while (month < 1 or month > 12):
    month = int(input("Введите номер месяца: "))

month_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
month_dict = {"зима": [12, 1, 2], "весна": [3, 4, 5], "лето": [6, 7, 8], "осень": [9, 10, 11]}

print("Эта {}".format(month_list[month - 1]))

for key, value in month_dict.items():
    if month in value:
        print("Эта точно {}".format(key))
        break
